passing-lambda.org
#+INCLUDE: theme/style.org 
#+TITLE: Passing C++ lambdas to C-function pointer callbacks
#+DESCRIPTION: Passing C++ lambdas to C callbacks
#+STARTUP: content 

* Passing C++ lambdas to C callbacks
** Overview 

A recurring need in C++ development is passing lambdas or functors,
also known as callable objects, to C functions that takes a function
pointer callback. This article aims to explore how to pass
function-objects (functors) and C++ lambdas to C function-pointer
callbacks. 
** Sample code with C-function pointer callback 
