passing-lambda.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-29 Wed 17:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Passing C++ lambdas to C-function pointer callbacks</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="Passing C++ lambdas to C callbacks"
 />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="theme/org-nav-theme.css" rel="stylesheet">
<link rel="icon" href="favicon.ico" type="image/vnd.microsoft.icon" />
</head>
<body>
<div id="content">
<h1 class="title">Passing C++ lambdas to C-function pointer callbacks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd49261f">1. Passing C++ lambdas to C callbacks</a>
<ul>
<li><a href="#org1ff2321">1.1. Overview</a></li>
<li><a href="#orgea2726d">1.2. Sample code with C-function pointer callback</a>
<ul>
<li><a href="#org67fe679">1.2.1. Source Code Listing</a></li>
<li><a href="#orgaf5adb2">1.2.2. Building and running</a></li>
<li><a href="#orgd6c363a">1.2.3. Analysis</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd49261f" class="outline-2">
<h2 id="orgd49261f"><span class="section-number-2">1</span> Passing C++ lambdas to C callbacks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1ff2321" class="outline-3">
<h3 id="org1ff2321"><span class="section-number-3">1.1</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A recurring need in C++ development is passing lambdas or functors,
also known as callable objects, to C functions that takes a function
pointer callback. This article aims to explore how to pass
function-objects (functors) and C++ lambdas to C function-pointer
callbacks. 
</p>
</div>
</div>
<div id="outline-container-orgea2726d" class="outline-3">
<h3 id="orgea2726d"><span class="section-number-3">1.2</span> Sample code with C-function pointer callback</h3>
<div class="outline-text-3" id="text-1-2">
</div>
