passing-lambda.html
<div id="outline-container-org67fe679" class="outline-4">
<h4 id="org67fe679"><span class="section-number-4">1.2.1</span> Source Code Listing</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
GIST with full sources: 
</p>
<ul class="org-ul">
<li><a href="https://gist.github.com/7db3de56dea0c502c6f749293b5013ef">https://gist.github.com/7db3de56dea0c502c6f749293b5013ef</a></li>
</ul>


<ul class="org-ul">
<li>File: <span class="underline">CMakeLists.txt</span></li>
</ul>

<div class="org-src-container">
<pre class="src src-cmake"><span class="org-function-name">cmake_minimum_required</span>(VERSION 3.9)
<span class="org-function-name">project</span>(cpp-lambda-test)

<span class="org-comment">#========== Global Configurations =============#</span>
<span class="org-comment">#----------------------------------------------#</span>

<span class="org-function-name">set</span>(CMAKE_CXX_STANDARD 17)     
<span class="org-function-name">set</span>(CMAKE_VERBOSE_MAKEFILE ON)

<span class="org-comment">#========== Targets Configurations ============#</span>

          <span class="org-function-name">add_library</span>( clib SHARED clib.c)

       <span class="org-function-name">add_executable</span>( consumer consumer.cpp)
<span class="org-function-name">target_link_libraries</span>( consumer clib)
</pre>
</div>

<ul class="org-ul">
<li>File: <span class="underline">clib.c</span>  (Target: clib / shared library)
<ul class="org-ul">
<li>C Shared library exporting functions with C-linkage
dotimes_version1() and dotimes_version2() which take C function
pointers callbacks.</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">stdio.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> 
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">stdlib.h</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Function without context pointer</span>
<span class="org-keyword">typedef</span> <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-type">callback_t</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">typedef</span> <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-type">callback_closure_t</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-doc">/** Function with C-callback argument without context pointer. */</span>
<span class="org-type">void</span> <span class="org-function-name">dotimes_version1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_t</span> <span class="org-variable-name">fun</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    printf<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">" [TRACE] &lt;ENTRY&gt; Called function: %s \n"</span>, __FUNCTION__<span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; size; i++<span class="org-rainbow-delimiters-depth-2">){</span> fun<span class="org-rainbow-delimiters-depth-3">(</span>i<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
    printf<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">" [TRACE] &lt;EXIT&gt; Called function: %s \n"</span>, __FUNCTION__<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-doc">/** Function with C-callback argument with context pointer for passing function state to</span>
<span class="org-doc"> *  to the function pointer. </span>
<span class="org-doc"> */</span>
<span class="org-type">void</span> <span class="org-function-name">dotimes_version2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_closure_t</span> <span class="org-variable-name">fun</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
    printf<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">" [TRACE] &lt;ENTRY&gt; Called function: %s \n"</span>, __FUNCTION__<span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-keyword">for</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; size; i++<span class="org-rainbow-delimiters-depth-2">){</span> fun<span class="org-rainbow-delimiters-depth-3">(</span>i, context<span class="org-rainbow-delimiters-depth-3">)</span>; <span class="org-rainbow-delimiters-depth-2">}</span>
    printf<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">" [TRACE] &lt;EXIT&gt; Called function: %s \n"</span>, __FUNCTION__<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<ul class="org-ul">
<li>File: <span class="underline">consumer.cpp</span> (Target: consumer / executable)
<ul class="org-ul">
<li>C++ executable application which consumes the C shared library
clib.so (Linux or BSD); clib.dylib (MacOSX) or clib.dll
(Windows).</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">iostream</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">functional</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span> <span class="org-comment-delimiter">// </span><span class="org-comment">std::function container </span>
<span class="org-preprocessor">#include</span> <span class="org-string"><span class="org-rainbow-delimiters-depth-1">&lt;</span></span><span class="org-string">cassert</span><span class="org-string"><span class="org-rainbow-delimiters-depth-1">&gt;</span></span>

<span class="org-keyword">using</span> <span class="org-type">callback_t</span>         = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">using</span> <span class="org-type">callback_closure_t</span> = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Functions with C-linkage </span>
<span class="org-preprocessor">#define</span> <span class="org-variable-name">EXTERN_C</span> <span class="org-keyword">extern</span> <span class="org-string">"C"</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Provided by the shared library (aka shared object on Unix-like systems) */</span>
EXTERN_C <span class="org-type">void</span> <span class="org-function-name">dotimes_version1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_t</span> <span class="org-variable-name">fun</span><span class="org-rainbow-delimiters-depth-1">)</span>;
EXTERN_C <span class="org-type">void</span> <span class="org-function-name">dotimes_version2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_closure_t</span> <span class="org-variable-name">fun</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-keyword">using</span> <span class="org-type">FunctionCallback1</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;

<span class="org-comment-delimiter">/** </span><span class="org-comment">Namespace contains workarounds for passing capturing lambdas </span>
<span class="org-comment"> * to function dotimes_version (C function without context void pointer)</span>
<span class="org-comment"> * </span>
<span class="org-comment"> * Note: This solution is not thread-safe. The most suitable workaround for</span>
<span class="org-comment"> * for passing capturing lambdas or C++ functors to C-callbakcs is to </span>
<span class="org-comment"> * redesign it for using a context void pointer, that allows passing state </span>
<span class="org-comment"> * to the C-callback.</span>
<span class="org-comment"> *----------------------------------------------------------------------*/</span>
<span class="org-keyword">namespace</span> <span class="org-constant">Workaround1</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-comment-delimiter">/* </span><span class="org-comment">This function encapsulates callback global variable </span>
<span class="org-comment">   ** for avoiding the global-initialization fiasco. </span>
<span class="org-comment">   *-----------------------------------------------------*/</span>
   <span class="org-keyword">auto</span> <span class="org-function-name">get_callback</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-type">FunctionCallback1</span>&amp;
   <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Global variable, its lifetimes corresponds to the program lifetime.</span>
        <span class="org-keyword">static</span> FunctionCallback1 callback;
        <span class="org-keyword">return</span> callback;
   <span class="org-rainbow-delimiters-depth-2">}</span>;

   <span class="org-comment-delimiter">/** </span><span class="org-comment">Set global variable callback */</span>
   <span class="org-keyword">auto</span> <span class="org-function-name">set_callback</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">FunctionCallback1</span> <span class="org-variable-name">func</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> 
   <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">callback</span> = get_callback<span class="org-rainbow-delimiters-depth-3">()</span>;
        callback = func;
   <span class="org-rainbow-delimiters-depth-2">}</span>

   <span class="org-type">void</span> <span class="org-function-name">workaround1_callback_adapter</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">)</span>
   <span class="org-rainbow-delimiters-depth-2">{</span>
        get_callback<span class="org-rainbow-delimiters-depth-3">()(</span>n<span class="org-rainbow-delimiters-depth-3">)</span>;
   <span class="org-rainbow-delimiters-depth-2">}</span>

   <span class="org-comment-delimiter">/* </span><span class="org-comment">Disadvantage: This solution is not thread-safe and requires locks </span>
<span class="org-comment">   *  to protect the callback global state. Only one callback can be </span>
<span class="org-comment">   *  passed per thread.  </span>
<span class="org-comment">   */</span>
   <span class="org-type">void</span> <span class="org-function-name">wrapper_to_dotimes_version1</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">FunctionCallback1</span> <span class="org-variable-name">func</span><span class="org-rainbow-delimiters-depth-2">)</span>
   <span class="org-rainbow-delimiters-depth-2">{</span>
         set_callback<span class="org-rainbow-delimiters-depth-3">(</span>func<span class="org-rainbow-delimiters-depth-3">)</span>;
         dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>size, &amp;workaround1_callback_adapter<span class="org-rainbow-delimiters-depth-3">)</span>;
   <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-keyword">struct</span> <span class="org-type">FunctionObject</span> 
<span class="org-rainbow-delimiters-depth-1">{</span>   
    <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;

    <span class="org-function-name">FunctionObject</span><span class="org-rainbow-delimiters-depth-2">(){</span> <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-function-name">FunctionObject</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">cnt</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">counter</span><span class="org-rainbow-delimiters-depth-2">(</span>cnt<span class="org-rainbow-delimiters-depth-2">){}</span>

    <span class="org-type">void</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"  [FUNCTOR ] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">void</span> <span class="org-function-name">FunctionObject_adapter</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
      assert<span class="org-rainbow-delimiters-depth-2">(</span>context != <span class="org-constant">nullptr</span><span class="org-rainbow-delimiters-depth-2">)</span>;
      <span class="org-comment-delimiter">// </span><span class="org-comment">Note: C-style cast also works, but prefer C++-style cast.</span>
      <span class="org-type">FunctionObject</span>* <span class="org-variable-name">pFunctor</span> = <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">FunctionObject</span>*<span class="org-rainbow-delimiters-depth-2">&gt;(</span>context<span class="org-rainbow-delimiters-depth-2">)</span>;

      <span class="org-comment-delimiter">// </span><span class="org-comment">[Also works in this way =&gt;&gt;] pFunctor-&gt;operator()(n);</span>
      <span class="org-rainbow-delimiters-depth-2">(</span>*pFunctor<span class="org-rainbow-delimiters-depth-2">)(</span>n<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>


<span class="org-type">int</span> <span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">argc</span>, <span class="org-type">char</span>** <span class="org-variable-name">argv</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">" [INFO] Consumer started OK."</span><span class="org-rainbow-delimiters-depth-2">)</span>;

      <span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 1 - Passing non-capturing lambda to C-function pointer callbacks without </span>
<span class="org-comment">      * void context pointer. </span>
<span class="org-comment">      */</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ===== [EXPERIMENT 1] Passing non-capturing lambdas ===============\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
      <span class="org-rainbow-delimiters-depth-2">{</span>     
           <span class="org-comment-delimiter">/** </span><span class="org-comment">Non-capturing lambdas are converted to function pointers. */</span>
           dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>5, <span class="org-rainbow-delimiters-depth-4">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-4">){</span>
                   <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-5">(</span><span class="org-string">" [EXPERIMENT 1] n = %d \n"</span>, n<span class="org-rainbow-delimiters-depth-5">)</span>;
           <span class="org-rainbow-delimiters-depth-4">}</span><span class="org-rainbow-delimiters-depth-3">)</span>;

      <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 2 - Passing capturing lambda to C-function pointer callbacks without</span>
<span class="org-comment">       * void context pointer. </span>
<span class="org-comment">       *</span>
<span class="org-comment">       * This experiment fails as capturing lambdas cannot be converted to function-pointers. </span>
<span class="org-comment">       */</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ===== [EXPERIMENT 2] Passing Capturing lambdas &lt;FAILURE&gt;  ========= \n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;
      <span class="org-rainbow-delimiters-depth-2">{</span>
           <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;
           <span class="org-keyword">auto</span> <span class="org-variable-name">lamb</span> = <span class="org-rainbow-delimiters-depth-3">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-3">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-3">){</span> 
                 <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"  [EXPERIMENT 2] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-4">)</span>;
           <span class="org-rainbow-delimiters-depth-3">}</span>;

          <span class="org-comment-delimiter">/*  </span><span class="org-comment">COMPILE-TIME-ERROR: Non-capturing lambdas cannot be passed to </span>
<span class="org-comment">           *  to function-pointers !!!</span>
<span class="org-comment">           *  Remove the next comment ('//') in order to see the compile-time error:</span>
<span class="org-comment">           * </span>
<span class="org-comment">           * Error: </span>
<span class="org-comment">           * ---------------------------------------------------------------</span>
<span class="org-comment">           *  </span>
<span class="org-comment">           *  [build] cpp-lambda-c/consumer.cpp:30:3: error: no matching function for call to 'dotimes_version1'</span>
<span class="org-comment">           *  [build]                 dotimes_version1(5, lamb);</span>
<span class="org-comment">           *  [build]                 ^~~~~~~~~~~~~~~~</span>
<span class="org-comment">           *  [build] consumer.cpp:7:17: note: candidate function not viable: no known conversion from '(lambda at /home/mxpkf8/temp-projects/cpp-lambda-c/consumer.cpp:26:15)' to 'callback_t' (aka 'void (*)(int)') for 2nd argument</span>
<span class="org-comment">           *  [build] extern "C" void dotimes_version1(int size, callback_t fun);</span>
<span class="org-comment">           *  [build]                 ^</span>
<span class="org-comment">            ****************************************************************/</span>

           <span class="org-comment-delimiter">// </span><span class="org-comment">Change from '0' to '1' to enable the compile-time error.</span>
<span class="org-preprocessor">           #if</span> 0  
             <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; Compile-time error! </span>
             dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>5, lamb<span class="org-rainbow-delimiters-depth-3">)</span>; 
<span class="org-preprocessor">           #endif</span> 

      <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 3 - Passing capturing lambda to C-function pointer callbacks without</span>
<span class="org-comment">       * void context pointer using a global-state workaround.</span>
<span class="org-comment">       */</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ===== [EXPERIMENT 3] Passing Capturing lambdas - Workaround 1  =====\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;   
      <span class="org-rainbow-delimiters-depth-2">{</span>
           <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;
           <span class="org-keyword">auto</span> <span class="org-variable-name">lamb</span> = <span class="org-rainbow-delimiters-depth-3">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-3">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-3">){</span> 
                   <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"  [EXPERIMENT 3] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-4">)</span>;
           <span class="org-rainbow-delimiters-depth-3">}</span>;

           <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\n ---&gt;&gt; Passing C++ capturing lambda "</span><span class="org-rainbow-delimiters-depth-3">)</span>;
           <span class="org-constant">Workaround1</span>::wrapper_to_dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>5, lamb<span class="org-rainbow-delimiters-depth-3">)</span>;

           <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\n ---&gt;&gt; Passing function-object (aka C++ Functor) "</span><span class="org-rainbow-delimiters-depth-3">)</span>;
           <span class="org-constant">Workaround1</span>::wrapper_to_dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>5, FunctionObject<span class="org-rainbow-delimiters-depth-4">(</span>25<span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">)</span>;
      <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 4 - Passing capturing lambda to C-function pointer callbacks with</span>
<span class="org-comment">       * void context pointer. </span>
<span class="org-comment">       */</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ===== [EXPERIMENT 4] Passing Functors to capturing lambda ==\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>;   
      <span class="org-rainbow-delimiters-depth-2">{</span>
              <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\n  ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 1] "</span><span class="org-rainbow-delimiters-depth-3">)</span>;
              <span class="org-type">FunctionObject</span> <span class="org-variable-name">obj1</span><span class="org-rainbow-delimiters-depth-3">(</span>26<span class="org-rainbow-delimiters-depth-3">)</span>;
              dotimes_version2<span class="org-rainbow-delimiters-depth-3">(</span>5, &amp;FunctionObject_adapter, &amp;obj1<span class="org-rainbow-delimiters-depth-3">)</span>;

              <span class="org-comment-delimiter">// </span><span class="org-comment">Note: This lambda can only be passed due to it be non-capturing.</span>
              <span class="org-keyword">auto</span> <span class="org-variable-name">adapter_for_FunctionObject</span> = <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-3">)</span>
              <span class="org-rainbow-delimiters-depth-3">{</span>
                      assert<span class="org-rainbow-delimiters-depth-4">(</span>context != <span class="org-constant">nullptr</span> &amp;&amp; <span class="org-string">"Context pointer should not be nullptr."</span><span class="org-rainbow-delimiters-depth-4">)</span>;           
                      <span class="org-type">FunctionObject</span>* <span class="org-variable-name">pFunctor</span> = <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-4">&lt;</span><span class="org-type">FunctionObject</span>*<span class="org-rainbow-delimiters-depth-4">&gt;(</span>context<span class="org-rainbow-delimiters-depth-4">)</span>;
                      pFunctor-&gt;<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-4">()(</span>n<span class="org-rainbow-delimiters-depth-4">)</span>;
              <span class="org-rainbow-delimiters-depth-3">}</span>;

              <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\n   ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 2] "</span><span class="org-rainbow-delimiters-depth-3">)</span>;
              <span class="org-type">FunctionObject</span> <span class="org-variable-name">obj2</span>;
              dotimes_version2<span class="org-rainbow-delimiters-depth-3">(</span>5, adapter_for_FunctionObject, &amp;obj2<span class="org-rainbow-delimiters-depth-3">)</span>;
      <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 5 - Passing capturing lambda to C-function pointer callbacks with</span>
<span class="org-comment">       * void context pointer. </span>
<span class="org-comment">       */</span>
      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ===== [EXPERIMENT 5] Passing Capturing lambdas &lt;APPROACH 1&gt; ==\n"</span><span class="org-rainbow-delimiters-depth-2">)</span>; 
      <span class="org-rainbow-delimiters-depth-2">{</span>                 
           <span class="org-keyword">using</span> <span class="org-type">FunctionCallback2</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-4">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span><span class="org-rainbow-delimiters-depth-4">)</span><span class="org-rainbow-delimiters-depth-3">&gt;</span>;

           <span class="org-keyword">auto</span> <span class="org-variable-name">adpter_for_lambda</span> = <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-3">)</span> 
           <span class="org-rainbow-delimiters-depth-3">{</span>
                   assert<span class="org-rainbow-delimiters-depth-4">(</span>context != <span class="org-constant">nullptr</span> &amp;&amp; <span class="org-string">"Context pointer (state) should not be null."</span><span class="org-rainbow-delimiters-depth-4">)</span>;
                   <span class="org-type">FunctionCallback2</span>* <span class="org-variable-name">pFunc</span> = <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-4">&lt;</span><span class="org-type">FunctionCallback2</span>*<span class="org-rainbow-delimiters-depth-4">&gt;(</span>context<span class="org-rainbow-delimiters-depth-4">)</span>;
                   <span class="org-rainbow-delimiters-depth-4">(</span>*pFunc<span class="org-rainbow-delimiters-depth-4">)(</span>n<span class="org-rainbow-delimiters-depth-4">)</span>;
           <span class="org-rainbow-delimiters-depth-3">}</span>;               

           <span class="org-type">int</span> <span class="org-variable-name">counter</span> = -100;
           <span class="org-keyword">auto</span> <span class="org-variable-name">callback_lambda</span> = <span class="org-rainbow-delimiters-depth-3">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-3">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-3">){</span> 
                   <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">"  [EXPERIMENT 5] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-4">)</span>;
           <span class="org-rainbow-delimiters-depth-3">}</span>;
           <span class="org-type">FunctionCallback2</span> <span class="org-variable-name">callback_object</span> = callback_lambda; 

           <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"\n  ---&gt;&gt; Passing capturing lambda [APPROACH 1 - Type erasure] --- "</span><span class="org-rainbow-delimiters-depth-3">)</span>;
           dotimes_version2<span class="org-rainbow-delimiters-depth-3">(</span>5, adpter_for_lambda, &amp;callback_object<span class="org-rainbow-delimiters-depth-3">)</span>;

      <span class="org-rainbow-delimiters-depth-2">}</span>

      <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n\n [INFO] System shutdown gracefully Ok."</span><span class="org-rainbow-delimiters-depth-2">)</span>;
      <span class="org-keyword">return</span> 0;
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>
