passing-lambda.org
*** Building and running 

Donwload and build sources: 

#+BEGIN_SRC sh  
  # Get sources 
   $ >> cd /tmp && git clone https://gist.github.com/7db3de56dea0c502c6f749293b5013ef callback && cd callback

   # Build 
   $ >> cmake --config Debug -H. -B_build 
   $ >> cmake --build _build --target 

   # Show _build directory 
   $ >> ls _build/
   CMakeCache.txt  CMakeFiles/  cmake_install.cmake  consumer*  libclib.so*  Makefile
#+END_SRC

Run executable: 'consumer'

#+BEGIN_SRC sh 
    $ >> _build/consumer 
    [INFO] Consumer started OK.

    ===== [EXPERIMENT 1] Passing non-capturing lambdas ===============

    [TRACE] <ENTRY> Called function: dotimes_version1 
    [EXPERIMENT 1] n = 0 
    [EXPERIMENT 1] n = 1 
    [EXPERIMENT 1] n = 2 
    [EXPERIMENT 1] n = 3 
    [EXPERIMENT 1] n = 4 
    [TRACE] <EXIT> Called function: dotimes_version1 

    ===== [EXPERIMENT 2] Passing Capturing lambdas <FAILURE>  ========= 


    ===== [EXPERIMENT 3] Passing Capturing lambdas - Workaround 1  =====


    --->> Passing C++ capturing lambda 
    [TRACE] <ENTRY> Called function: dotimes_version1 
     [EXPERIMENT 3] n = 0  / counter = 10 
     [EXPERIMENT 3] n = 1  / counter = 11 
     [EXPERIMENT 3] n = 2  / counter = 12 
     [EXPERIMENT 3] n = 3  / counter = 13 
     [EXPERIMENT 3] n = 4  / counter = 14 
    [TRACE] <EXIT> Called function: dotimes_version1 

    --->> Passing function-object (aka C++ Functor) 
    [TRACE] <ENTRY> Called function: dotimes_version1 
     [FUNCTOR ] n = 0  / counter = 25 
     [FUNCTOR ] n = 1  / counter = 26 
     [FUNCTOR ] n = 2  / counter = 27 
     [FUNCTOR ] n = 3  / counter = 28 
     [FUNCTOR ] n = 4  / counter = 29 
    [TRACE] <EXIT> Called function: dotimes_version1 

    ===== [EXPERIMENT 4] Passing Functors to capturing lambda ==


     --->> Passing function-object (aka C++ Functor) [APPROACH 1] 
    [TRACE] <ENTRY> Called function: dotimes_version2 
     [FUNCTOR ] n = 0  / counter = 26 
     [FUNCTOR ] n = 1  / counter = 27 
     [FUNCTOR ] n = 2  / counter = 28 
     [FUNCTOR ] n = 3  / counter = 29 
     [FUNCTOR ] n = 4  / counter = 30 
    [TRACE] <EXIT> Called function: dotimes_version2 

      --->> Passing function-object (aka C++ Functor) [APPROACH 2] 
    [TRACE] <ENTRY> Called function: dotimes_version2 
     [FUNCTOR ] n = 0  / counter = 10 
     [FUNCTOR ] n = 1  / counter = 11 
     [FUNCTOR ] n = 2  / counter = 12 
     [FUNCTOR ] n = 3  / counter = 13 
     [FUNCTOR ] n = 4  / counter = 14 
    [TRACE] <EXIT> Called function: dotimes_version2 

    ===== [EXPERIMENT 5] Passing Capturing lambdas <APPROACH 1> ==


     --->> Passing capturing lambda [APPROACH 1 - Type erasure] --- 
    [TRACE] <ENTRY> Called function: dotimes_version2 
     [EXPERIMENT 5] n = 0  / counter = -100 
     [EXPERIMENT 5] n = 1  / counter = -99 
     [EXPERIMENT 5] n = 2  / counter = -98 
     [EXPERIMENT 5] n = 3  / counter = -97 
     [EXPERIMENT 5] n = 4  / counter = -96 
    [TRACE] <EXIT> Called function: dotimes_version2 


    [INFO] System shutdown gracefully Ok.

#+END_SRC




