passing-lambda.html

<div id="outline-container-orgaf5adb2" class="outline-4">
<h4 id="orgaf5adb2"><span class="section-number-4">1.2.2</span> Building and running</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Donwload and build sources: 
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Get sources </span>
 $ &gt;&gt; cd /tmp &amp;&amp; git clone https://gist.github.com/7db3de56dea0c502c6f749293b5013ef callback &amp;&amp; <span class="org-builtin">cd</span> callback

 <span class="org-comment-delimiter"># </span><span class="org-comment">Build </span>
 $ &gt;&gt; cmake --config Debug -H. -B_build 
 $ &gt;&gt; cmake --build _build --target 

 <span class="org-comment-delimiter"># </span><span class="org-comment">Show _build directory </span>
 $ &gt;&gt; ls _build/
 CMakeCache.txt  CMakeFiles/  cmake_install.cmake  consumer*  libclib.so*  Makefile
</pre>
</div>

<p>
Run executable: 'consumer'
</p>

<div class="org-src-container">
<pre class="src src-sh">$ &gt;&gt; _build/consumer 
[INFO] Consumer started OK.

===== [EXPERIMENT 1] Passing non-capturing lambdas ===============

[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version1 
[EXPERIMENT 1] n = 0 
[EXPERIMENT 1] n = 1 
[EXPERIMENT 1] n = 2 
[EXPERIMENT 1] n = 3 
[EXPERIMENT 1] n = 4 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version1 

===== [EXPERIMENT 2] Passing Capturing lambdas &lt;FAILURE&gt;  ========= 


===== [EXPERIMENT 3] Passing Capturing lambdas - Workaround 1  =====


---&gt;&gt; Passing C++ capturing lambda 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version1 
 [EXPERIMENT 3] n = 0  / counter = 10 
 [EXPERIMENT 3] n = 1  / counter = 11 
 [EXPERIMENT 3] n = 2  / counter = 12 
 [EXPERIMENT 3] n = 3  / counter = 13 
 [EXPERIMENT 3] n = 4  / counter = 14 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version1 

---&gt;&gt; Passing function-object (aka C++ Functor) 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version1 
 [FUNCTOR ] n = 0  / counter = 25 
 [FUNCTOR ] n = 1  / counter = 26 
 [FUNCTOR ] n = 2  / counter = 27 
 [FUNCTOR ] n = 3  / counter = 28 
 [FUNCTOR ] n = 4  / counter = 29 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version1 

===== [EXPERIMENT 4] Passing Functors to capturing lambda ==


 ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 1] 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [FUNCTOR ] n = 0  / counter = 26 
 [FUNCTOR ] n = 1  / counter = 27 
 [FUNCTOR ] n = 2  / counter = 28 
 [FUNCTOR ] n = 3  / counter = 29 
 [FUNCTOR ] n = 4  / counter = 30 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 

  ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 2] 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [FUNCTOR ] n = 0  / counter = 10 
 [FUNCTOR ] n = 1  / counter = 11 
 [FUNCTOR ] n = 2  / counter = 12 
 [FUNCTOR ] n = 3  / counter = 13 
 [FUNCTOR ] n = 4  / counter = 14 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 

===== [EXPERIMENT 5] Passing Capturing lambdas &lt;APPROACH 1&gt; ==


 ---&gt;&gt; Passing capturing lambda [APPROACH 1 - Type erasure] --- 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [EXPERIMENT 5] n = 0  / counter = -100 
 [EXPERIMENT 5] n = 1  / counter = -99 
 [EXPERIMENT 5] n = 2  / counter = -98 
 [EXPERIMENT 5] n = 3  / counter = -97 
 [EXPERIMENT 5] n = 4  / counter = -96 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 


[INFO] System shutdown gracefully Ok.

</pre>
</div>
</div>
</div>
