passing-lambda.html




<div id="outline-container-orgd6c363a" class="outline-4">
<h4 id="orgd6c363a"><span class="section-number-4">1.2.3</span> Analysis</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
The goal of the application (consumer.cpp) is to call pass C++ lambdas
and C++ callable objects (functors) as he following C-functions which
takes C-function pointer callbacks:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">using</span> <span class="org-type">callback_t</span>         = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-keyword">using</span> <span class="org-type">callback_closure_t</span> = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Functions with C-linkage </span>
<span class="org-preprocessor">#define</span> <span class="org-variable-name">EXTERN_C</span> <span class="org-keyword">extern</span> <span class="org-string">"C"</span>

<span class="org-comment-delimiter">/** </span><span class="org-comment">Provided by the shared library (aka shared object on Unix-like systems) */</span>
EXTERN_C <span class="org-type">void</span> <span class="org-function-name">dotimes_version1</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_t</span> <span class="org-variable-name">fun</span><span class="org-rainbow-delimiters-depth-1">)</span>;
EXTERN_C <span class="org-type">void</span> <span class="org-function-name">dotimes_version2</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_closure_t</span> <span class="org-variable-name">fun</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;
</pre>
</div>


<p>
<b>Experiment 1:</b>
</p>

<ul class="org-ul">
<li><span class="underline">Non-capturing</span> lambdas are converted to function-pointers when
passed to C-function pointer callbacks.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 1 - Passing non-capturing lambda to C-function pointer callbacks without </span>
<span class="org-comment"> * void context pointer. </span>
<span class="org-comment"> */</span>
 <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\n ===== [EXPERIMENT 1] Passing non-capturing lambdas ===============\n"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
 <span class="org-rainbow-delimiters-depth-1">{</span>      
      <span class="org-comment-delimiter">/** </span><span class="org-comment">Non-capturing lambdas are converted to function pointers. */</span>
      dotimes_version1<span class="org-rainbow-delimiters-depth-2">(</span>5, <span class="org-rainbow-delimiters-depth-3">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-3">){</span>
              <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-4">(</span><span class="org-string">" [EXPERIMENT 1] n = %d \n"</span>, n<span class="org-rainbow-delimiters-depth-4">)</span>;
      <span class="org-rainbow-delimiters-depth-3">}</span><span class="org-rainbow-delimiters-depth-2">)</span>;

 <span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Program output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">[INFO] Consumer started OK.

===== [EXPERIMENT 1] Passing non-capturing lambdas ===============

[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version1 
[EXPERIMENT 1] n = 0 
[EXPERIMENT 1] n = 1 
[EXPERIMENT 1] n = 2 
[EXPERIMENT 1] n = 3 
[EXPERIMENT 1] n = 4 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version1 

</pre>
</div>

<p>
<b>Experiment 2:</b> [COMPILE-TIME ERROR]
</p>

<ul class="org-ul">
<li>A a <span class="underline">capturing lambdas</span> cannot be converted into a function pointer,
the following code causes a compile-time error if the "#if" is
enabled as "#if 1".</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::puts<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\n ===== [EXPERIMENT 2] Passing Capturing lambdas &lt;FAILURE&gt;  ========= \n"</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;
     <span class="org-keyword">auto</span> <span class="org-variable-name">lamb</span> = <span class="org-rainbow-delimiters-depth-2">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">){</span> 
           <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"  [EXPERIMENT 2] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>;

     <span class="org-comment-delimiter">// </span><span class="org-comment">Change from '0' to '1' to enable the compile-time error.</span>
<span class="org-preprocessor">     #if</span> 0  
       <span class="org-comment-delimiter">// </span><span class="org-comment">=&gt; Compile-time error! </span>
       dotimes_version1<span class="org-rainbow-delimiters-depth-2">(</span>5, lamb<span class="org-rainbow-delimiters-depth-2">)</span>; 
<span class="org-preprocessor">     #endif</span> 

<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Compile-time error: 
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">build</span><span class="org-rainbow-delimiters-depth-1">]</span> cpp-lambda-c/consumer.cpp:30:3: error: no matching function <span class="org-keyword">for</span> call to <span class="org-warning">'</span>dotimes_version1<span class="org-warning">'</span>
<span class="org-rainbow-delimiters-depth-1">[</span>build<span class="org-rainbow-delimiters-depth-1">]</span>                 dotimes_version1<span class="org-rainbow-delimiters-depth-1">(</span>5, lamb<span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">build</span><span class="org-rainbow-delimiters-depth-1">]</span>                 ^~~~~~~~~~~~~~~~
<span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">build</span><span class="org-rainbow-delimiters-depth-1">]</span> consumer.cpp:7:17: note: candidate function <span class="org-keyword">not</span> viable: no known conversion from <span class="org-warning">'</span>
         <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">lambda</span> <span class="org-variable-name">at</span> /consumer.cpp:26:15<span class="org-rainbow-delimiters-depth-1">)</span><span class="org-warning">'</span> to <span class="org-warning">'</span>callback_t<span class="org-warning">'</span> <span class="org-rainbow-delimiters-depth-1">(</span>aka <span class="org-warning">'</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span>*<span class="org-rainbow-delimiters-depth-2">)(</span><span class="org-type">int</span><span class="org-rainbow-delimiters-depth-2">)</span><span class="org-warning">'</span><span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-keyword">for</span> 2nd argument

<span class="org-rainbow-delimiters-depth-1">[</span>build<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-keyword">extern</span> <span class="org-string">"C"</span> <span class="org-type">void</span> dotimes_version1<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">callback_t</span> <span class="org-variable-name">fun</span><span class="org-rainbow-delimiters-depth-1">)</span>;
<span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">build</span><span class="org-rainbow-delimiters-depth-1">]</span>                 ^
</pre>
</div>


<p>
<b>Experiment 3:</b> Workaround for passing capturing-lambdas to C-function  pointer callbacks. 
</p>

<ul class="org-ul">
<li>Passing a capturing lambda to a C-function that takes a C function
pointer callback, requires a workaround using global state. The
shortcoming of this method is the lack of thread-safety due to the
usage of global state. A thread-safe version of this workaround
requires using locks, such as mutex, in order to avoid race
condition undefined-behaviors. The most suitable solution to this
issue is to redesign the function <span class="underline">dotimes_version1</span> by making it
take an extra void pointer for passing the C function pointer
state.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::puts<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\n ===== [EXPERIMENT 3] Passing Capturing lambdas - Workaround 1  =====\n"</span><span class="org-rainbow-delimiters-depth-1">)</span>; 
<span class="org-rainbow-delimiters-depth-1">{</span>
     <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;
     <span class="org-keyword">auto</span> <span class="org-variable-name">lamb</span> = <span class="org-rainbow-delimiters-depth-2">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">){</span> 
         <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"  [EXPERIMENT 3] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>;

     <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ---&gt;&gt; Passing C++ capturing lambda "</span><span class="org-rainbow-delimiters-depth-2">)</span>;
     <span class="org-constant">Workaround1</span>::wrapper_to_dotimes_version1<span class="org-rainbow-delimiters-depth-2">(</span>5, lamb<span class="org-rainbow-delimiters-depth-2">)</span>;

     <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n ---&gt;&gt; Passing function-object (aka C++ Functor) "</span><span class="org-rainbow-delimiters-depth-2">)</span>;
     <span class="org-constant">Workaround1</span>::wrapper_to_dotimes_version1<span class="org-rainbow-delimiters-depth-2">(</span>5, FunctionObject<span class="org-rainbow-delimiters-depth-3">(</span>25<span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-cpp">===== <span class="org-rainbow-delimiters-depth-1">[</span><span class="org-constant">EXPERIMENT</span> 3<span class="org-rainbow-delimiters-depth-1">]</span> Passing Capturing lambdas - Workaround 1  =====


---&gt;&gt; Passing C++ capturing lambda 
<span class="org-rainbow-delimiters-depth-1">[</span>TRACE<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>ENTRY<span class="org-rainbow-delimiters-depth-1">&gt;</span> Called function: dotimes_version1 
 <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 3<span class="org-rainbow-delimiters-depth-1">]</span> n = 0  / counter = 10 
 <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 3<span class="org-rainbow-delimiters-depth-1">]</span> n = 1  / counter = 11 
 <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 3<span class="org-rainbow-delimiters-depth-1">]</span> n = 2  / counter = 12 
 <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 3<span class="org-rainbow-delimiters-depth-1">]</span> n = 3  / counter = 13 
 <span class="org-rainbow-delimiters-depth-1">[</span>EXPERIMENT 3<span class="org-rainbow-delimiters-depth-1">]</span> n = 4  / counter = 14 
<span class="org-rainbow-delimiters-depth-1">[</span>TRACE<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>EXIT<span class="org-rainbow-delimiters-depth-1">&gt;</span> Called function: dotimes_version1 

---&gt;&gt; Passing function-object <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">aka</span> <span class="org-variable-name">C</span>++ Functor<span class="org-rainbow-delimiters-depth-1">)</span> 
<span class="org-rainbow-delimiters-depth-1">[</span>TRACE<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>ENTRY<span class="org-rainbow-delimiters-depth-1">&gt;</span> Called function: dotimes_version1 
 <span class="org-rainbow-delimiters-depth-1">[</span>FUNCTOR <span class="org-rainbow-delimiters-depth-1">]</span> n = 0  / counter = 25 
 <span class="org-rainbow-delimiters-depth-1">[</span>FUNCTOR <span class="org-rainbow-delimiters-depth-1">]</span> n = 1  / counter = 26 
 <span class="org-rainbow-delimiters-depth-1">[</span>FUNCTOR <span class="org-rainbow-delimiters-depth-1">]</span> n = 2  / counter = 27 
 <span class="org-rainbow-delimiters-depth-1">[</span>FUNCTOR <span class="org-rainbow-delimiters-depth-1">]</span> n = 3  / counter = 28 
 <span class="org-rainbow-delimiters-depth-1">[</span>FUNCTOR <span class="org-rainbow-delimiters-depth-1">]</span> n = 4  / counter = 29 
<span class="org-rainbow-delimiters-depth-1">[</span>TRACE<span class="org-rainbow-delimiters-depth-1">]</span> <span class="org-rainbow-delimiters-depth-1">&lt;</span>EXIT<span class="org-rainbow-delimiters-depth-1">&gt;</span> Called function: dotimes_version1 

</pre>
</div>

<p>
Workaround code at to of file consumer.cpp: 
</p>

<ul class="org-ul">
<li>The function <span class="underline">get__callback</span> returns a reference to the global state
or global variable named callback whose lifetime is the same as
the application lifetime. The global variable is encapsulated in
this function for avoiding global-initialization-fiasco undefined
behavior.</li>

<li>The function <span class="underline">set_callback</span> sets the global variable (global state)
encapsulated by the function <span class="underline">set_callback</span>.</li>

<li>The function <span class="underline">wrapper_to_dotimes_version1</span> sets the callback global
variable and calls the C-function dotimes_version1.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">using</span> <span class="org-type">FunctionCallback1</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-1">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">&gt;</span>;


<span class="org-keyword">namespace</span> <span class="org-constant">Workaround1</span> <span class="org-rainbow-delimiters-depth-1">{</span>
   <span class="org-comment-delimiter">/* </span><span class="org-comment">This function encapsulates callback global variable </span>
<span class="org-comment">   ** for avoiding the global-initialization fiasco. </span>
<span class="org-comment">   *-----------------------------------------------------*/</span>
   <span class="org-keyword">auto</span> <span class="org-function-name">get_callback</span><span class="org-rainbow-delimiters-depth-2">()</span> -&gt; <span class="org-type">FunctionCallback1</span>&amp;
   <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">Global variable, its lifetimes corresponds to the program lifetime.</span>
        <span class="org-keyword">static</span> FunctionCallback1 callback;
        <span class="org-keyword">return</span> callback;
   <span class="org-rainbow-delimiters-depth-2">}</span>;

   <span class="org-comment-delimiter">/** </span><span class="org-comment">Set global variable callback */</span>
   <span class="org-keyword">auto</span> <span class="org-function-name">set_callback</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">FunctionCallback1</span> <span class="org-variable-name">func</span><span class="org-rainbow-delimiters-depth-2">)</span> -&gt; <span class="org-type">void</span> 
   <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-keyword">auto</span>&amp; <span class="org-variable-name">callback</span> = get_callback<span class="org-rainbow-delimiters-depth-3">()</span>;
        callback = func;
   <span class="org-rainbow-delimiters-depth-2">}</span>

   <span class="org-type">void</span> <span class="org-function-name">workaround1_callback_adapter</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">)</span>
   <span class="org-rainbow-delimiters-depth-2">{</span>
        get_callback<span class="org-rainbow-delimiters-depth-3">()(</span>n<span class="org-rainbow-delimiters-depth-3">)</span>;
   <span class="org-rainbow-delimiters-depth-2">}</span>

   <span class="org-comment-delimiter">/* </span><span class="org-comment">Disadvantage: This solution is not thread-safe and requires locks </span>
<span class="org-comment">   *  to protect the callback global state. Only one callback can be </span>
<span class="org-comment">   *  passed per thread.  </span>
<span class="org-comment">   */</span>
   <span class="org-type">void</span> <span class="org-function-name">wrapper_to_dotimes_version1</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">FunctionCallback1</span> <span class="org-variable-name">func</span><span class="org-rainbow-delimiters-depth-2">)</span>
   <span class="org-rainbow-delimiters-depth-2">{</span>
         set_callback<span class="org-rainbow-delimiters-depth-3">(</span>func<span class="org-rainbow-delimiters-depth-3">)</span>;
         dotimes_version1<span class="org-rainbow-delimiters-depth-3">(</span>size, &amp;workaround1_callback_adapter<span class="org-rainbow-delimiters-depth-3">)</span>;
   <span class="org-rainbow-delimiters-depth-2">}</span>

<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
<b>Experiment 4:</b> Passing functors to function-pointer arguments.
</p>

<ul class="org-ul">
<li>Selected code before main function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-keyword">using</span> <span class="org-type">callback_closure_t</span> = <span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-1">(</span>*<span class="org-rainbow-delimiters-depth-1">)</span> <span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Provided by the shared library (clib)</span>
EXTERN_C <span class="org-type">void</span> <span class="org-function-name">dotimes_version2</span><span class="org-rainbow-delimiters-depth-1">(</span> <span class="org-type">int</span> <span class="org-variable-name">size</span>
                                <span class="org-comment-delimiter">// </span><span class="org-comment">C-function pointer argument </span>
                               , <span class="org-type">callback_closure_t</span> <span class="org-variable-name">fun</span>

                                <span class="org-comment-delimiter">// </span><span class="org-comment">void-pointer (context pointer) </span>
                                <span class="org-comment-delimiter">// </span><span class="org-comment">Extra argument for passing state </span>
                                <span class="org-comment-delimiter">// </span><span class="org-comment">to the callback function-pointer.</span>
                               , <span class="org-type">void</span>* <span class="org-variable-name">context</span>
                              <span class="org-rainbow-delimiters-depth-1">)</span>;


<span class="org-keyword">struct</span> <span class="org-type">FunctionObject</span> 
<span class="org-rainbow-delimiters-depth-1">{</span>   
    <span class="org-type">int</span> <span class="org-variable-name">counter</span> = 10;

    <span class="org-function-name">FunctionObject</span><span class="org-rainbow-delimiters-depth-2">(){</span> <span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-function-name">FunctionObject</span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">cnt</span><span class="org-rainbow-delimiters-depth-2">)</span>: <span class="org-function-name">counter</span><span class="org-rainbow-delimiters-depth-2">(</span>cnt<span class="org-rainbow-delimiters-depth-2">){}</span>

    <span class="org-type">void</span> <span class="org-keyword">operator</span><span class="org-function-name"><span class="org-rainbow-delimiters-depth-2">()</span></span><span class="org-rainbow-delimiters-depth-2">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">{</span>
        <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"  [FUNCTOR ] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>
<span class="org-rainbow-delimiters-depth-1">}</span>;

<span class="org-type">void</span> <span class="org-function-name">FunctionObject_adapter</span><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-1">)</span>
<span class="org-rainbow-delimiters-depth-1">{</span>
     assert<span class="org-rainbow-delimiters-depth-2">(</span>context != <span class="org-constant">nullptr</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-comment-delimiter">// </span><span class="org-comment">Note: C-style cast also works, but prefer C++-style cast.</span>
    <span class="org-type">FunctionObject</span>* <span class="org-variable-name">pFunctor</span> = <span class="org-keyword">static_cast</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">FunctionObject</span>*<span class="org-rainbow-delimiters-depth-2">&gt;(</span>context<span class="org-rainbow-delimiters-depth-2">)</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">[Also works in this way =&gt;&gt;] pFunctor-&gt;operator()(n);</span>
    <span class="org-rainbow-delimiters-depth-2">(</span>*pFunctor<span class="org-rainbow-delimiters-depth-2">)(</span>n<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<ul class="org-ul">
<li>Often C-functions that takes a function pointer callback provide
an extra void-pointer parameter for passing a pointer to the
function-pointer context or state. If a function takes this extra
parameter, passing lambdas or functors becomes easier. The
following code takes advantage of this extra void pointer for
passing the function FunctionObject to the C function
<span class="underline">dotimes_version2</span>.</li>
</ul>


<div class="org-src-container">
<pre class="src src-cpp"><span class="org-function-name">std</span>::puts<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\n ===== [EXPERIMENT 4] Passing Functors to capturing lambda ==\n"</span><span class="org-rainbow-delimiters-depth-1">)</span>; 
<span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n  ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 1] "</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-type">FunctionObject</span> <span class="org-variable-name">obj1</span><span class="org-rainbow-delimiters-depth-2">(</span>26<span class="org-rainbow-delimiters-depth-2">)</span>;
    dotimes_version2<span class="org-rainbow-delimiters-depth-2">(</span>5, &amp;FunctionObject_adapter, &amp;obj1<span class="org-rainbow-delimiters-depth-2">)</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Note: This lambda can only be passed due to it be non-capturing.</span>
    <span class="org-keyword">auto</span> <span class="org-variable-name">adapter_for_FunctionObject</span> = <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-2">)</span>
    <span class="org-rainbow-delimiters-depth-2">{</span>
        assert<span class="org-rainbow-delimiters-depth-3">(</span>context != <span class="org-constant">nullptr</span> &amp;&amp; <span class="org-string">"Context pointer should not be nullptr."</span><span class="org-rainbow-delimiters-depth-3">)</span>;         
        <span class="org-type">FunctionObject</span>* <span class="org-variable-name">pFunctor</span> = <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">FunctionObject</span>*<span class="org-rainbow-delimiters-depth-3">&gt;(</span>context<span class="org-rainbow-delimiters-depth-3">)</span>;
        pFunctor-&gt;<span class="org-keyword">operator</span><span class="org-rainbow-delimiters-depth-3">()(</span>n<span class="org-rainbow-delimiters-depth-3">)</span>;
    <span class="org-rainbow-delimiters-depth-2">}</span>;

    <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n   ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 2] "</span><span class="org-rainbow-delimiters-depth-2">)</span>;
    <span class="org-type">FunctionObject</span> <span class="org-variable-name">obj2</span>;
    dotimes_version2<span class="org-rainbow-delimiters-depth-2">(</span>5, adapter_for_FunctionObject, &amp;obj2<span class="org-rainbow-delimiters-depth-2">)</span>;
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">===== [EXPERIMENT 4] Passing Functors to capturing lambda ==


 ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 1] 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [FUNCTOR ] n = 0  / counter = 26 
 [FUNCTOR ] n = 1  / counter = 27 
 [FUNCTOR ] n = 2  / counter = 28 
 [FUNCTOR ] n = 3  / counter = 29 
 [FUNCTOR ] n = 4  / counter = 30 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 

  ---&gt;&gt; Passing function-object (aka C++ Functor) [APPROACH 2] 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [FUNCTOR ] n = 0  / counter = 10 
 [FUNCTOR ] n = 1  / counter = 11 
 [FUNCTOR ] n = 2  / counter = 12 
 [FUNCTOR ] n = 3  / counter = 13 
 [FUNCTOR ] n = 4  / counter = 14 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
</pre>
</div>

<p>
<b>Experiment 5:</b> Passing capturing-lambdas to function-pointer arguments.
</p>

<ul class="org-ul">
<li>This code is similar to the one from experiment 4. It passes
capturing lambda to the C function <span class="underline">dotimes_version2</span> using the
extra void pointer (context) of this function.</li>
</ul>

<div class="org-src-container">
<pre class="src src-cpp"><span class="org-comment-delimiter">/* </span><span class="org-comment">EXPERIMENT 5 - Passing capturing lambda to C-function pointer callbacks with</span>
<span class="org-comment"> * void context pointer. </span>
<span class="org-comment"> */</span>
<span class="org-function-name">std</span>::puts<span class="org-rainbow-delimiters-depth-1">(</span><span class="org-string">"\n ===== [EXPERIMENT 5] Passing Capturing lambdas &lt;APPROACH 1&gt; ==\n"</span><span class="org-rainbow-delimiters-depth-1">)</span>;   
<span class="org-rainbow-delimiters-depth-1">{</span>                   
     <span class="org-keyword">using</span> <span class="org-type">FunctionCallback2</span> = <span class="org-constant">std</span>::<span class="org-type">function</span><span class="org-rainbow-delimiters-depth-2">&lt;</span><span class="org-type">void</span> <span class="org-rainbow-delimiters-depth-3">(</span><span class="org-type">int</span> <span class="org-variable-name">size</span><span class="org-rainbow-delimiters-depth-3">)</span><span class="org-rainbow-delimiters-depth-2">&gt;</span>;

     <span class="org-keyword">auto</span> <span class="org-variable-name">adpter_for_lambda</span> = <span class="org-rainbow-delimiters-depth-2">[](</span><span class="org-type">int</span> <span class="org-variable-name">n</span>, <span class="org-type">void</span>* <span class="org-variable-name">context</span><span class="org-rainbow-delimiters-depth-2">)</span> 
     <span class="org-rainbow-delimiters-depth-2">{</span>
             assert<span class="org-rainbow-delimiters-depth-3">(</span>context != <span class="org-constant">nullptr</span> &amp;&amp; <span class="org-string">"Context pointer (state) should not be null."</span><span class="org-rainbow-delimiters-depth-3">)</span>;
             <span class="org-type">FunctionCallback2</span>* <span class="org-variable-name">pFunc</span> = <span class="org-keyword">reinterpret_cast</span><span class="org-rainbow-delimiters-depth-3">&lt;</span><span class="org-type">FunctionCallback2</span>*<span class="org-rainbow-delimiters-depth-3">&gt;(</span>context<span class="org-rainbow-delimiters-depth-3">)</span>;
             <span class="org-rainbow-delimiters-depth-3">(</span>*pFunc<span class="org-rainbow-delimiters-depth-3">)(</span>n<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>;             

     <span class="org-type">int</span> <span class="org-variable-name">counter</span> = -100;
     <span class="org-keyword">auto</span> <span class="org-variable-name">callback_lambda</span> = <span class="org-rainbow-delimiters-depth-2">[</span>&amp;<span class="org-variable-name">counter</span><span class="org-rainbow-delimiters-depth-2">](</span><span class="org-type">int</span> <span class="org-variable-name">n</span><span class="org-rainbow-delimiters-depth-2">){</span> 
             <span class="org-constant">std</span>::printf<span class="org-rainbow-delimiters-depth-3">(</span><span class="org-string">"  [EXPERIMENT 5] n = %d  / counter = %d \n"</span>, n, counter++<span class="org-rainbow-delimiters-depth-3">)</span>;
     <span class="org-rainbow-delimiters-depth-2">}</span>;
     <span class="org-type">FunctionCallback2</span> <span class="org-variable-name">callback_object</span> = callback_lambda; 

     <span class="org-constant">std</span>::puts<span class="org-rainbow-delimiters-depth-2">(</span><span class="org-string">"\n  ---&gt;&gt; Passing capturing lambda [APPROACH 1 - Type erasure] --- "</span><span class="org-rainbow-delimiters-depth-2">)</span>;
     dotimes_version2<span class="org-rainbow-delimiters-depth-2">(</span>5, adpter_for_lambda, &amp;callback_object<span class="org-rainbow-delimiters-depth-2">)</span>;

<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Output: 
</p>

<div class="org-src-container">
<pre class="src src-sh">===== [EXPERIMENT 5] Passing Capturing lambdas &lt;APPROACH 1&gt; ==


 ---&gt;&gt; Passing capturing lambda [APPROACH 1 - Type erasure] --- 
[TRACE] &lt;ENTRY&gt; Called <span class="org-keyword">function</span>: dotimes_version2 
 [EXPERIMENT 5] n = 0  / counter = -100 
 [EXPERIMENT 5] n = 1  / counter = -99 
 [EXPERIMENT 5] n = 2  / counter = -98 
 [EXPERIMENT 5] n = 3  / counter = -97 
 [EXPERIMENT 5] n = 4  / counter = -96 
[TRACE] &lt;EXIT&gt; Called <span class="org-keyword">function</span>: dotimes_version2 


[INFO] System shutdown gracefully Ok.

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-07-29 Wed 17:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
